## Production: newrelic
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
```terraform
Plan: 0 to add, 1 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                     NAME                      |
|--------|-----------------------------------------------|
| update | `newrelic_workflow.terraform_notify_workflow` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  ~ update in-place

Terraform will perform the following actions:

  # newrelic_workflow.terraform_notify_workflow will be updated in-place
  ~ resource "newrelic_workflow" "terraform_notify_workflow" {
        id                    = "b6ee8bdc-d939-4091-8e82-6212776c580b"
        name                  = "Terraform Notify Workflow - production"
        # (7 unchanged attributes hidden)

      - destination {
          - channel_id              = "718ee534-9e6b-4e30-9c97-fd7ff2b066db" -> null
          - name                    = "Terraform Notify Slack Channel - production" -> null
          - notification_triggers   = [
              - "ACKNOWLEDGED",
              - "ACTIVATED",
              - "CLOSED",
            ] -> null
          - type                    = "SLACK_LEGACY" -> null
          - update_original_message = true -> null
        }
      + destination {
          + channel_id              = "718ee534-9e6b-4e30-9c97-fd7ff2b066db"
          + name                    = (known after apply)
          + notification_triggers   = (known after apply)
          + type                    = (known after apply)
          + update_original_message = true
        }

        # (1 unchanged block hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

